TODO:
1. Import the companies.json dataset into a mongodb collection
2. Using pymongo connect to the database and:
    1. From all the companies get first office, number of people and company name
    2. Convert it to GeoJSON format
    3. Insert it back to another mongodb collection
3. In another notebook or python file
    1. Query the newly created collection geospatially using $near operator and for each company calculate the nearest companies with radius R meters. Use R=100, R=1000 and R=10000
    2. For each company sum the results of the nearest companies and save all results in a JSON file containing an array with the following format: 
[ 
    {
        id: XXXX
        name: <company_name>, 
        office_location:<geojson_point_office_location>,
        nearest_workers:{ 
            “r=100”:9999,
            “r=1000”:9999,
            “r=10000”:9999,
        }
    },
    {…},
    {...}
]

4. Using the created json file, add it to tableau and create 3 sheets using geospartial plot.
5. Create a tableau story and present the results you’ve found

In [1]:
import os
import pymongo
import numpy as np
import pandas as pd
import scipy
import matplotlib.pyplot as plt
from scipy import stats
from pprint import pprint
from pandas.io.json import json_normalize
from pymongo import MongoClient

In [11]:
client = MongoClient("mongodb://pedrocd:pedrociddiaz1@ds029565.mlab.com:29565/mydb")
db = client.mydb

In [3]:
companies = db.companies.find({"offices.0":{"$exists": True}},
                          projection={ "name": 1 ,"offices": 1, "number_of_employees": 1, "_id": 0})
df = pd.DataFrame(list(companies))
df['lat'] = json_normalize(df['offices'][0])['latitude']
display(df.head())

,name,number_of_employees,offices,lat
0,AdventNet,600.0,"[{'description': 'Headquarters', 'address1': '...",37.692934
1,TechnologyGuide,10.0,"[{'description': None, 'address1': '7420 Jager...",NaN
2,Wetpaint,47.0,"[{'description': '', 'address1': '710 - 2nd Av...",NaN
3,Zoho,1600.0,"[{'description': 'Headquarters', 'address1': '...",NaN
4,Digg,60.0,"[{'description': None, 'address1': '135 Missis...",NaN

In [4]:
df['lat'] = [json_normalize(df['offices'][i])['latitude'][0] for i in range(len(df))]
df['lng'] = [json_normalize(df['offices'][i])['longitude'][0] for i in range(len(df))]
df = df.drop(['offices'], axis=1)
display(df.head(10))

              name  number_of_employees        lat         lng
0        AdventNet                600.0  37.692934 -121.904945
1  TechnologyGuide                 10.0  39.066850  -84.351532
2         Wetpaint                 47.0  47.603122 -122.333253
3             Zoho               1600.0  37.692934 -121.904945
4             Digg                 60.0  37.764726 -122.394523
5         Facebook               5299.0  37.416050 -122.151801
6        Omnidrive                  NaN        NaN         NaN
7          Postini                  NaN  37.506885 -122.247573
8             Geni                 18.0  34.090368 -118.393064
9          Flektor                  NaN  34.025958 -118.379768

In [5]:
df = df[(df['number_of_employees'].isnull()==False)]
df = df[(df['lat'].isnull()==False)]
df.head(10)

                     name  number_of_employees        lat         lng
0               AdventNet                600.0  37.692934 -121.904945
1         TechnologyGuide                 10.0  39.066850  -84.351532
2                Wetpaint                 47.0  47.603122 -122.333253
3                    Zoho               1600.0  37.692934 -121.904945
4                    Digg                 60.0  37.764726 -122.394523
5                Facebook               5299.0  37.416050 -122.151801
8                    Geni                 18.0  34.090368 -118.393064
10  Fox Interactive Media                  0.0  34.076179 -118.394170
14                Twitter               1300.0  37.776805 -122.416924
16                 Scribd                 50.0  37.789634 -122.404052

In [6]:
df = df.reset_index(drop=True)
display(len(df))
display(df.head())

5614

              name  number_of_employees        lat         lng
0        AdventNet                600.0  37.692934 -121.904945
1  TechnologyGuide                 10.0  39.066850  -84.351532
2         Wetpaint                 47.0  47.603122 -122.333253
3             Zoho               1600.0  37.692934 -121.904945
4             Digg                 60.0  37.764726 -122.394523

In [7]:
df['geometry'] = [{'type':'Point', 'coordinates':[df['lng'][i], df['lat'][i]]} for i in range(len(df))]
df = df.drop(['lat'], axis=1)
df = df.drop(['lng'], axis=1)
df.head()

,name,number_of_employees,geometry
0,AdventNet,600.0,"{'type': 'Point', 'coordinates': [-121.904945,..."
1,TechnologyGuide,10.0,"{'type': 'Point', 'coordinates': [-84.351532, ..."
2,Wetpaint,47.0,"{'type': 'Point', 'coordinates': [-122.333253,..."
3,Zoho,1600.0,"{'type': 'Point', 'coordinates': [-121.904945,..."
4,Digg,60.0,"{'type': 'Point', 'coordinates': [-122.394523,..."

In [8]:
with open('geo.json', 'w')  as f:
  for i, e in df.iterrows():
      f.write(e.to_json()+'\n')